checkfree/src/test/resources/expected/test_clicktel_ping.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://api.clickatell.com/soap/webservice"><SOAP-ENV:Header/><SOAP-ENV:Body><ns0:ping><session_id>123</session_id></ns0:ping></SOAP-ENV:Body></SOAP-ENV:Envelope>